<a href="https://colab.research.google.com/github/Shivaram17/100DaysOfAdvancedPythonCoding/blob/main/10077AdvancedPython_Removing_duplicates_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

query = """ CREATE TABLE TEST4
            (a VARCHAR(20), b VARCHAR(20),
             c REAL, d INTEGER);"""


con = sqlite3.connect('mydata.sqlite')

con.execute(query)

# con.commit()
# insert a few rows of data
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]
stmt = 'INSERT INTO TEST1 VALUES(?,?,?,?)'
con.executemany(stmt, data)
# con.commit()
# fetch
cursor = con.execute('select * from TEST1')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
# missing data
import pandas as pd
string_data = pd.Series(['goc', 'euc', 'BR'])
string_data[0] = None
string_data.isnull()
# filtering out missing data
from numpy import nan as NA
import numpy as np
s = pd.Series([1,NA,2,6,NA,8])
s.dropna()
s[s.notnull()]

df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 2] = NA
# df.dropna()
# df.fillna(0, inplace = True)

df.fillna(method = 'bfill', limit =2)
s.fillna(s.mean())

0    1.00
1    4.25
2    2.00
3    6.00
4    4.25
5    8.00
dtype: float64

In [5]:
# Removing  duplicates
import pandas as pd
data = pd.DataFrame({'k1': ['one','two'] * 3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})
# finds a duplicate
data.duplicated()
# drop duplicates
data.drop_duplicates()
data['v'] = range(7)
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v
0  one   1  0
1  two   1  1
2  one   2  2
3  two   3  3
4  one   3  4
6  two   4  6